/******************************************************************************
 * 作者：朱清豪                                                                
 * 时间：2018.3.6                                                             
 * 描述：定义各种返回状态，用作异常处理               
 *****************************************************************************/
#ifndef STATUS_H
#define STATUS_H
#define OK          1   //成功
#define ERROR       0   //错误   
#define INFEASIBLE -1   //未能实行
#define OVERFLOW   -2   //溢出
#endif